Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.ReadContent(System.String)
Reads the content from a html file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new html view for the systems analysis report.
document:
The document where the view is to be created.
reportName:
The name of the created analysis report. If empty, a default name will be chosen with date and time postfixed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisOutputFolder
The full path of the output folder for systems analysis
Since:
2020

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.WeatherFile
The full path name of the weather file used for the systems analysis.
Since:
2020

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.SystemsAnalysisWorkflowFile
The full path name of the original system analysis workflow file.
Since:
2020

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.HtmlReportContent
The entire content of the html report.
Since:
2020

Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport
A html view of the systems analysis report.
Since:
2020